const cards = [{
        title: "Кам'янець-Подільський",
        text: 'Замок був споруджений в 11-12 століттях. Основні укріплення фортеці були добудовані в 16-17 століттях. Фортеця є відмінним зразком надійної фортифікації Східної Європи. Фортеця досі приймає відвідувачів.',
        img: 'Zamki/1.jpg',
    },
    {
        title: "Олеський замок",
        text: "Був побудований в 14-17 століттях, на землях Галичини. Точна дата будівництва замку невідома. Вперше про нього згадується в 1837 році. Кажуть, що його побудував син князя Львовича. У 1646 році його зруйнували татари, але в 1682 році його викупив і відбудував колись народжений у ньому князь Речі Посполитої Ян ІІІ Собеський.",
        img: 'Zamki/2.jpg',
    },
    {
        title: "Підгорецький замок",
        text: "Знаходиться у Львівській області. Він споруджений у стилі епохи Відродження двома відомими архітекторами того часу. Один із замовників замку був гетьман Станіслав Конецпольський, він викупив його у Підгорецьких. Будівництво замку проходило з 1635 року по 1640.",
        img: 'Zamki/4.jpg',
    },
    {
        title: "Острозький замок",
        text: "Побудований на пагорбі. Раніше там було дерев'яне укріплення, але у 1241 році воно було зруйноване. З 14 по 17 століття він був родовим маєтком Острозьких. У замку є дві вежі. На території замку є Богоявленський собор.",
        img: 'Zamki/5.jpg',
    },
    {
        title: "Замок Шенборнк",
        text: "Один з наймолодших замків. Розташований в селі Карпати, що в Мукачівському районі Закарпаття. Був заснований в 1890 році як мисливський будиночок, а також як резиденція для графа Шенборна. У ньому 365 вікон, 52 димаря, 12 входів. Всі ці числа відповідають дням у році, тижням в році, і місяцям у році. Замок діючий.",
        img: 'Zamki/6.jpg',
    },
    {
        title: "Золочівський замок",
        text: "Знаходиться у Львівській області. Був побудований більше ніж 500 років тому. Це комплекс з двох палаців. Обидва побудовані в стилі ренесанс. У ньому були знайдені два камені з невідомими написами на них.",
        img: 'Zamki/7.jpg',
    },
    {
        title: "Хотинський замок",
        text: "Приймає середньовічні фестивалі, там знімають кіно. Тисячі туристів щорічно відвідують Хотинський замок. Це одне із семи чудес України. Будівництво кам'яних укріплень Хотина прийнято пов'язувати з Галицько-Волинським князівством і з ім'ям Данила Галицького.",
        img: 'Zamki/9.jpg',
    },
    {
        title: "Меджибізький замокк",
        text: "Замок-фортеця, розташований в селищі Меджибіж, у верхів'ях річки Південний Буг, при впаданні ріки Бужок, в 30 кілометрах на схід від міста Хмельницького. Найстаріша інформація, що стосується фортеці у Меджибожі, походить з часів існування укріпленого міста Рюрикович, яке виникло над Південним Бугом близько 1146 року. Першим господарем меджибізького міста найімовірніше був Святослав Рюрикович. В 1240 році, під час коли містом володів князь Галицький Данило Романович, Меджибіж захопили і знищили татари. Після того, як литовці у 1362 році відвоювали Поділля у татар, на місці колишніх укріплень було споруджено укріплений замок.",
        img: 'Zamki/10.jpg',
    },
];

for (let i = 0; i < cards.length; i++) {
    const new_card = document.createElement('div');

    new_card.innerHTML = `
    <div class="content_container">
        <img src="${cards[i].img}" class="content_image"></img>
        <br>
        <div class="content--real--text">
         <h2>${cards[i].title}</h2>
         ${cards[i].text} 
        </div>
    </div>`;

    document.querySelector('.cards-wrapper').appendChild(new_card);
}