const cards = [{
        title: "Національний дендрологічний парк Софіївка",
        text: "Софіївка - одне з найкрасивіших рукотворних чудес України, пам'ятник світового садово-паркового мистецтва кінця XVIII століття. Щорічно парк, що займає близько 180 га, відвідують понад 500 тисяч осіб. Софіївка заснована в 1796 році власником міста Умані, польським магнатом Станіславом Потоцьким та названий на честь його дружини Софії Вітт-Потоцької. По руслу річки Кам'янка споруджено ряд штучних басейнів та ставів: Верхній та Нижній, водоспади, шлюзи, каскади, підземна ріка Ахеронт завдовжки 224 м. Парк прикрашають Левкадська і Тарпейська скелі, гроти, павільйони, альтанки і антична скульптура.",
        img: 'diva/1.jpg',
    },
    {
        title: "Гранітний каньйон на річці Гірський Тікич",
        text: "Мальовничий гранітний каньйон на річці Гірський Тікич біля села Буки (кордон Черкаської та Вінницької областей) по праву вважається одним з природних чудес України. Річка Гірський Тікич тече у протерозойських гранітах, вік яких оцінюється в 2 млрд років, і утворює оригінальний, глибокий до 20 м і вузький місцями 20-40 м каньйон. Перед входом в Букській каньйон води Гірського Тікича стрімко скочуються з брили граніту, тим самим створюючи гучний водоспад Вир.",
        img: 'diva/2.jpg',
    },
    {
        title: "Дністровський каньйон",
        text: "Утворений цей каньйон в результаті вимивання Дністром гірської породи Подільської височини. Він розташований на межі Івано-Франківської, Тернопільської, Чернівецької та Хмельницької областей. Це найбільший в Україні і один з найбільших в Європі каньйон. Він являє собою долину, чиї стрімкі береги сягають від 100 до 250 метрів над водою. Крім того, на території Дністровського каньйону знаходиться близько 100 пам'яток живої і неживої природи світового значення. Тут збереглися унікальні еталони відслонень гірських порід. Також, на території Дністровського району знаходиться 26 населених пунктів, де була досліджена трипільська культура.",
        img: 'diva/3.jpg',
    },
    {
        title: "Долина нарцисів",
        text: "Легендарна Долина нарцисів розкинулась в урочищі Кіреші між р. Тиса і р. Хустець на околиці Хуста. Природа цієї реліктової долини збереглася з Льодовикового періоду. Популяція нарциса вузьколистого тут унікальна тим, що знаходиться не в горах, а на рівнині 180-200 м над рівнем моря. Подібні зарості, але меншої площі, залишилися в небагатьох місцях - Альпах, гірських районах Румунії та деяких Балканських країн. Масове цвітіння Долини нарцисів зазвичай починається в першій половині травня, триває близько двох тижнів точна дата залежить від погоди. Земля покривається білим квітковим килимом незвичайної краси, подивитися на який приїжджають тисячі туристів.",
        img: 'diva/4.jpg',
    },
    {
        title: "Асканія-Нова",
        text: "Асканія-Нова – унікальний біосферний заповідник України. Тут можна насолодитися красою степової природи – у парку росте понад 400 видів квітів і трав, 150 видів чагарників і дерев. Фауну Асканії-Нови представляють зебри, африканські та індійські антилопи, південноамериканські верблюди, олені, американські бізони, лами, шотландські поні, коні Пржевальського , сайгаки і т. д. На території заповідника гніздяться білі і чорні лебеді, лебеді-кликуни, журавлі, куріпки, жайворонки, дрохви, фламінго, всього більше 60 різних видів.",
        img: 'diva/5.jpg',
    },
    {
        title: "Острів Хортиця в Запоріжжі",
        text: "Це справді унікальне місце – 'острів свободи', колиска українського козацтва. Тут стояла легендарна Січ. Національний заповідник Хортиця - це не просто найбільший острів на Дніпрі, але і унікальний природний та історичний комплекс. Природа острова вражає своєю красою. На порівняно невеликій його площі довжина Хортиці становить 12 км, а ширина — в середньому 2,5 км є свої степи, луки, дубові та хвойні ліси. Завдяки особливим мікрокліматичним умовам, які виникли через велику кількість сонця, прісної води і сухого повітря, флора острова істотно відрізняється від материкової.",
        img: 'diva/6.jpg',
    },
    {
        title: "Озеро Світязь і Шацькі озера",
        text: "В межиріччі Прип'яті і Західного Бугу на Волині, серед лісових масивів, розташувалася група з понад 30 озер. Найбільше з них – Світязь – через кришталево чисту воду і значну глибину часто називають українським Байкалом. В теплу пору року вода біля берегів озера добре прогрівається, що робить популярним цю місцевість серед відпочиваючих. Шацькі озера розташовані серед лісових масивів, в яких побудовано велику кількість баз і таборів відпочинку. Для охорони рідкісних природних комплексів у районі Шацьких озер в 1983 році створений Шацький природний національний парк площею 32 500 га.",
        img: 'diva/7.jpg',
    },
    {
        title: "Ландшафтний парк в Буках",
        text: "Парк закладений на берегах р. Раставиця в 1996 р. на кошти сквирського підприємця В. Суслова в селі Буки Київської області. За його ініціативою було розчищено засмічене русло річки, відновлена гребля, реконструйовано і переобладнано під міні-ГЕС старовинний водяний млин. Мальовничі пороги і скелясті береги Роставиці були перетворені в ландшафтний парк з великою кількістю містків, альтанок і різноманітних скульптур. В ландшафт вдало вписані будівлі садиби родини Суслових: житловий будинок з сімейною каплицею, 'вартова башта', мисливський будиночок, столярний цех та ін. В міні-зоопарку можна побачити левів, ведмедів, оленів, поні, павичів.",
        img: 'diva/8.jpg',
    },
    {
        title: "Озеро Синевир",
        text: "Високогірне льодовикове озеро Синевир розташоване на території Національного природного парку 'Синевир'. Це найбільше і красиве озеро в Карпатах. Розмір озера змінюється в залежності від кількості опадів. Середня площа - 4-5 га, глибина - 8-10 метрів. Найглибша точка - 22 м. Вода дуже чиста, здається яскраво- блакитною. Водиться форель озерна, райдужна та струмкова, однак риболовля заборонена. На території НПП 'Синевир' діє центр реабілітації бурих ведмедів.",
        img: 'diva/9.jpg',
    },
    {
        title: "Олешківські піски",
        text: "Олешківські піски — піщана арена, розкинулася в Цюрупинському районі Херсонської області, в 30 км від обласного центру. У діаметрі піски досягають 15 км і є величезним масивом піску в Європі. З супутника пустеля виглядає як маленька жовте пляма на лівому березі Дніпровського лиману. Понад 150 тисяч гектарів - 30 кілометрів від заходу на схід і 150 км з півночі на південь - покриті нескінченними піщаними барханами. Дніпровські піски існували з давніх часів, але їх розширенню перешкоджала місцева природна рослинність. Олешківська пустеля в нинішньому своєму вигляді виникла відносно недавно: через випас великих стад овець в ХІХ столітті, які повністю знищили всю траву до пісків, а ерозія вітру сприяла захопленню все більшої і більшої території. Часто трапляються в Олешківській пустелі і озера — як пересохлі, так і повноводні, а також мінеральні. На глибині 300-400 метрів залягло прісне підземне озеро з чистою, і дивно смачною водою.",
        img: 'diva/10.jpg',
    },
];

for (let i = 0; i < cards.length; i++) {
    const new_card = document.createElement('div');

    new_card.innerHTML = `
<div class="content_container">
    <img src="${cards[i].img}" class="content_image"></img>
    <br>
    <div class="content--real--text">
     <h2>${cards[i].title}</h2>
     ${cards[i].text} 
    </div>
</div>`;

    document.querySelector('.cards-wrapper').appendChild(new_card);
}